// V_N ДОК: БП ТестированиеКандидата Модуль ФормаБизнесПроцесса пункт ТестНаАдминистрирование 
// содержание :
// исправлено : 
// исправить : 
// ошибки : 
// примечания : 
// результат работы : + -

// составное имя: имя пункта - ТестНаАдминистрирование имя события - ПроверкаУсловия

Процедура ТестНаАдминистрированиеПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = ПройденТестАдминистрирование;
КонецПроцедуры

// ТестНаПрограммирование ПроверкаУсловия
Процедура ТестНаПрограммированиеПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = ПройденТестПрограммирование;
КонецПроцедуры


