// V_0 ДОК: НевыходСотрудника 
// содержание : сырая выдача конструктор
// исправлено : заменить 1 в ВидРасчета искать в ПланыВидовРасчетов
// исправить : ДатаОкончания приведем к концу дня КонецДня(ДатаОкончания)
// ошибки : 

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр РегистрНачисленияЗарплаты
	Движения.РегистрНачисленияЗарплаты.Записывать = Истина;
	Движение = Движения.РегистрНачисленияЗарплаты.Добавить();
	Движение.Сторно = Ложь;
	Движение.ВидРасчета = 1;
	Движение.ПериодДействияНачало = ДатаНачала;
	Движение.ПериодДействияКонец = ДатаОкончания;
	Движение.ПериодРегистрации = Дата;
	Движение.Сотрудник = Сотрудник;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
