// V_N ДОК: ЗаполнениеГрафикаПредприятия
// содержание : делает движние в Графике предприятия
// исправлено : 
// исправить : 
// ошибки : 


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// Вставить содержимое обработчика. 
	
	ТекущаяДата_ = НачалоГода(Дата);
	КонецГода_ = КонецГода(Дата);       
	
	// флаг разрешающий запись 
	Движения.ГрафикПредприятия.Записывать = Истина;  
	
	Пока ТекущаяДата_ <= КонецГода_ Цикл        
		// заполняем регистр график предприятия 
		// создаем объект добавления в регистр - при выходе из процедуры он внесет изменения в рег если Записывать = Истина;
		Движение = Движения.ГрафикПредприятия.Добавить();  
		
		Движение.Дата = ТекущаяДата_;
		// номер дня до включая 6 до включая субботу
		Если ДеньНедели(ТекущаяДата_) <= 6 Тогда 
			Движение.РабочийДень = 1;
		Иначе 
			Движение.РабочийДень = 0;
		КонецЕсли; 
		
		// прибавим к ТекущаяДата_ 1 сутки
		ТекущаяДата_ = ТекущаяДата_ + 24*3600;			
		
	КонецЦикла;
КонецПроцедуры


