// 

Для Сч=2 по 4 Цикл
	Сообщить(Сч);	
КонецЦикла;	

Кор = 1;  
Пока (Кор + 1)*(Кор + 1) < 30000   Цикл	
	Кор = Кор + 1;	
	Если Кор = 10 Тогда 
		Прервать;
	КонецЕсли;    
	Продолжить;
КонецЦикла; 

Сообщить(Кор);

ДвухзначноеЧисло = 20;
Степень = 4;
Рез = 1;    

// Если Инд > Степень nj jib,rb yt ,eltn 
	Для Инд = 1 по Степень Цикл  
		Рез = Рез * ДвухзначноеЧисло;	
	КонецЦикла;


Сообщить(Рез); 
Сообщить(Pow(ДвухзначноеЧисло, Степень));

Если Рез > 10000 Тогда 	
	Сообщить("Превышает 10000");	
КонецЕсли;         

Стр1 = " Привет";  
Стр2 = "мир! ";
КонСтр = Стр1 + ", " + Стр2;  

Сообщить(Констр);     

// Остаток от деления
Сообщить(5%3);   // 2    

// Дата
Сообщить(ТекущаяДата());  
// Дата + сек
Сообщить(ТекущаяДата() + 3600);

Сообщить(НЕ ЛОЖЬ);    

Сообщить(СтрДлина(КонСтр)); // 14
Сообщить(СтрДлина(СокрЛП(КонСтр))); // 12       

Чис = 12345123;
Дел = 65436;

Дробь = Чис/Дел;

Сообщить(Дробь); // 188,659499358151476251604621309
Сообщить(Окр(Дробь)); // 189 
Сообщить(Окр(Дробь,2)); // 189          
Сообщить(Цел(Дробь)); // 188   

Сообщить("Окр(1.5,0,0)");
Сообщить(Окр(1.5,0,0)); // в меньшую сторону 

Сообщить("Окр(1.5,0,1)");
Сообщить(Окр(1.5,0,1)); // в большую сторону       

Сообщить("ТекущаяДата() : " + ТекущаяДата());
Сообщить("КонецДня(ТекущаяДата()) : " + КонецДня(ТекущаяДата()));
Сообщить("Год(ТекущаяДата()) : " + Год(ТекущаяДата()));
Сообщить("ДеньНедели(ТекущаяДата()) : " + ДеньНедели(ТекущаяДата()));    
Сообщить("НачалоМесяца(ТекущаяДата()) : " + НачалоМесяца(ТекущаяДата()));
Сообщить("ДобавитьМесяц(ТекущаяДата()) : " + ДобавитьМесяц(ТекущаяДата(),3)); 

ТекДата = ТекущаяДата();     
Сообщить("ТекДата : " + ТекДата); 
КонецГода_ = КонецГода(ТекДата);     

// Домашнее зад 7 день

Для айтем = 1 по 10 Цикл 
	Сообщить("айтем: "+айтем);  
	Сообщить("КонецГода_ : " + КонецГода_);
	ДеньНедели_ = ДеньНедели(КонецГода_); 
	//Сообщить("ДеньНедели_ : " + ДеньНедели_);
	Если ДеньНедели_ = 1  Тогда 
		Сообщить("Понедельник");
	ИначеЕсли ДеньНедели_ = 2  Тогда 
		Сообщить("Вторник");
	ИначеЕсли ДеньНедели_ = 3  Тогда 
		Сообщить("Среда");
	ИначеЕсли ДеньНедели_ = 4  Тогда 
		Сообщить("Четверг");
	ИначеЕсли ДеньНедели_ = 5  Тогда 
		Сообщить("Пятница");
	ИначеЕсли ДеньНедели_ = 6  Тогда 
		Сообщить("Суббота");
	ИначеЕсли ДеньНедели_ = 7  Тогда 
		Сообщить("Воскресенье");
	КонецЕсли;       
	
	ПоследСекГода = КонецДня(КонецГода_);
	
	СледГод = ПоследСекГода + 1;
	//Сообщить("СледГод" + СледГод);
	//ДеньНедели_ = ДеньНедели(КонецГода(СледГод));  
	// Сообщить("КонецГода(СледГод)" + КонецГода(СледГод));
	КонецГода_ = КонецГода(СледГод); 
	
КонецЦикла;	
	
	











	

	
	

