
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр РегНакПродукты Расход
	Движения.РегНакПродукты.Записывать = Истина;
	Для Каждого ТекСтрокаТабчДокПокупка Из ТабчДокПокупка Цикл
		Движение = Движения.РегНакПродукты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.РегНакПродуктыИзмПродукт = ТекСтрокаТабчДокПокупка.РекТабчДокПотребПродукт;
		Движение.РегНакПродуктыРесКоличество = ТекСтрокаТабчДокПокупка.РекТабчДокПотребКоличество;
		Движение.РегНакПродуктыРесСумма = 0;
	КонецЦикла;

КонецПроцедуры
