// V_N ДОК: БП ТестированиеКандидата Модуль ФормаБизнесПроцесса
// содержание :
// исправлено : 
// исправить : 
// ошибки : 
// примечания : 
// результат работы : + -

// составное имя: имя пункта - ТестНаАдминистрирование имя события - ПроверкаУсловия
Процедура ТестНаАдминистрированиеПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = ПройденТестАдминистрирование;
КонецПроцедуры

// ТестНаПрограммирование ПроверкаУсловия
Процедура ТестНаПрограммированиеПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = ПройденТестПрограммирование;
КонецПроцедуры

Процедура ОператорПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	ПредложеннаяВакансия = Перечисления.Вакансии.Оператор;
КонецПроцедуры    

// составное имя: имя пункта - ТестНаАдминистрирование имя события - ПриВыполнении
Процедура АдминистраторПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	ПредложеннаяВакансия = Перечисления.Вакансии.Администратор;
КонецПроцедуры  

Процедура ПрограммистПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	ПредложеннаяВакансия = Перечисления.Вакансии.Программист;
КонецПроцедуры



