
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр РегНакПродукты Приход
	Движения.РегНакПродукты.Записывать = Истина;
	Для Каждого ТекСтрокаТабчДокПокупка Из ТабчДокПокупка Цикл
		Движение = Движения.РегНакПродукты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.РегНакПродуктыИзмПродукт = ТекСтрокаТабчДокПокупка.РекТабчДокПокупкаПродукт;
		Движение.РегНакПродуктыРесКоличество = ТекСтрокаТабчДокПокупка.РекТабчДокПокупкаКоличество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
