



Процедура ОбработкаПроведения(Отказ, Режим) 

	Движения.РегОстаткиПродуктов.Записывать = Истина;	

	// -------------------------------------------------------Начало нового кода 
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокПотреблениеТабчДокПотреблениеПродукты.РекТабчДокПотреблениеПродуктыПродукт КАК РекТабчДокПотреблениеПродуктыПродукт,
		|	СУММА(ДокПотреблениеТабчДокПотреблениеПродукты.РекТабчДокПотреблениеПродуктыКоличество) КАК РекТабчДокПотреблениеПродуктыКоличество
		|ПОМЕСТИТЬ втДокПотребления
		|ИЗ
		|	Документ.ДокПотребление.ТабчДокПотреблениеПродукты КАК ДокПотреблениеТабчДокПотреблениеПродукты
		|ГДЕ
		|	ДокПотреблениеТабчДокПотреблениеПродукты.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ДокПотреблениеТабчДокПотреблениеПродукты.РекТабчДокПотреблениеПродуктыПродукт
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втДокПотребления.РекТабчДокПотреблениеПродуктыПродукт КАК РекТабчДокПотреблениеПродуктыПродукт,
		|	втДокПотребления.РекТабчДокПотреблениеПродуктыКоличество КАК РекТабчДокПотреблениеПродуктыКоличество,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(РегОстаткиПродуктовОстатки.РесРегОстаткиПродуктовКоличествоОстаток, 0) >= втДокПотребления.РекТабчДокПотреблениеПродуктыКоличество
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК РекЗапрДостаточноОстатков,
		|	ВЫБОР
		|		КОГДА втДокПотребления.РекТабчДокПотреблениеПродуктыКоличество = ЕСТЬNULL(РегОстаткиПродуктовОстатки.РесРегОстаткиПродуктовКоличествоОстаток, 0)
		|			ТОГДА ЕСТЬNULL(РегОстаткиПродуктовОстатки.РесРегОстаткиПродуктовСуммаОстаток, 0)
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЕСТЬNULL(РегОстаткиПродуктовОстатки.РесРегОстаткиПродуктовКоличествоОстаток, 0) = 0
		|					ТОГДА 0
		|				ИНАЧЕ ЕСТЬNULL(РегОстаткиПродуктовОстатки.РесРегОстаткиПродуктовСуммаОстаток, 0) / ЕСТЬNULL(РегОстаткиПродуктовОстатки.РесРегОстаткиПродуктовКоличествоОстаток, 0) * втДокПотребления.РекТабчДокПотреблениеПродуктыКоличество
		|			КОНЕЦ
		|	КОНЕЦ КАК СтоимостьПотребленияПродукта,
		|	втДокПотребления.РекТабчДокПотреблениеПродуктыПродукт.Представление КАК НазваниеПродукта
		|ИЗ
		|	втДокПотребления КАК втДокПотребления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегОстаткиПродуктов.Остатки(
		|				&ВремяЗапроса,
		|				ИзмРегОстаткиПродуктовПродукт В
		|					(ВЫБРАТЬ
		|						втДокПотребления.РекТабчДокПотреблениеПродуктыПродукт КАК РекТабчДокПотреблениеПродуктыПродукт
		|					ИЗ
		|						втДокПотребления КАК втДокПотребления)) КАК РегОстаткиПродуктовОстатки
		|		ПО втДокПотребления.РекТабчДокПотреблениеПродуктыПродукт = РегОстаткиПродуктовОстатки.ИзмРегОстаткиПродуктовПродукт";
	
Запрос.УстановитьПараметр("ВремяЗапроса", МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи   
		// ПРОВЕРКА : Если хотя бы одного продукта нехватает - Отказ в проведеии
		Если НЕ ВыборкаДетальныеЗаписи.РекЗапрДостаточноОстатков Тогда 
			// ----------------- Здесь скрытый запрос (!?) к базе данных !!! Вынести в примеры ---------------------
			// Сообщить("Внимание! Недостаточно продукта:" + ВыборкаДетальныеЗаписи.РекТабчДокПотреблениеПродуктыПродукт);      
			Сообщить("Внимание! Недостаточно продукта:" + ВыборкаДетальныеЗаписи.НазваниеПродукта);
			Отказ = Истина;
		КонецЕсли;	
	КонецЦикла; 
	
	Если НЕ Отказ Тогда 
		// Вставим сюда Движение     
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
 		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Движение = Движения.РегОстаткиПродуктов.Добавить();
			
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.ИзмРегОстаткиПродуктовПродукт = ВыборкаДетальныеЗаписи.РекТабчДокПотреблениеПродуктыПродукт;
			Движение.РесРегОстаткиПродуктовКоличество = ВыборкаДетальныеЗаписи.РекТабчДокПотреблениеПродуктыКоличество;    
			Движение.РесРегОстаткиПродуктовСумма = ВыборкаДетальныеЗаписи.СтоимостьПотребленияПродукта;

       КонецЦикла;
		
	КонецЕсли;		
 
		
КонецПроцедуры
